In [1]:
# importação bibliotecas

import pandas as pd                       # importação pandas

In [2]:
# importando os dados

file = './data/ufo.csv'
ufo = pd.read_csv(file)

In [3]:
# info gerais do dataset

ufo.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18241 entries, 0 to 18240
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   City             18216 non-null  object
 1   Colors Reported  2882 non-null   object
 2   Shape Reported   15597 non-null  object
 3   State            18241 non-null  object
 4   Time             18241 non-null  object
dtypes: object(5)
memory usage: 712.7+ KB

In [4]:
# primeiros registros

ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [9]:
# ultimos registros

ufo.tail()

              City Colors Reported Shape Reported State              Time
18236   Grant Park             NaN       TRIANGLE    IL  12/31/2000 23:00
18237  Spirit Lake             NaN           DISK    IA  12/31/2000 23:00
18238  Eagle River             NaN            NaN    WI  12/31/2000 23:45
18239  Eagle River             RED          LIGHT    WI  12/31/2000 23:45
18240         Ybor             NaN           OVAL    FL  12/31/2000 23:59

In [18]:
# importando dataset com valores nulos para melhor entendimento

file = './data/nulos.csv'
nulos = pd.read_csv(file)
nulos.head()

   id   nome
0   1    NaN
1   2  Clara
2   3    NaN
3   4   Joao

- isnull() - retorna um dataframe com os valores nulos
- isnull().sum() - retorna um dataframe com a quantidade de valores nulos
- isnull().sum().sum() - retorna o total de valores nulos
- isnull().sum().sum() / len(nulos) - retorna a porcentagem de valores nulos
-  isnull().sum().sum() / len(nulos) * 100 - retorna a porcentagem de valores nulos em %

In [17]:
# ser valore nulos retorna True ou False para os valores nulos

nulos.isnull().tail()

      id   nome
0  False   True
1  False  False
2  False   True
3  False  False

In [21]:
ufo.isnull().tail()

        City  Colors Reported  Shape Reported  State   Time
18236  False             True           False  False  False
18237  False             True           False  False  False
18238  False             True            True  False  False
18239  False            False           False  False  False
18240  False             True           False  False  False

In [23]:
# notnull retorna True ou False para valores não nulos

nulos.notnull().tail()

     id   nome
0  True  False
1  True   True
2  True  False
3  True   True

In [24]:
ufo.notnull().tail()

       City  Colors Reported  Shape Reported  State  Time
18236  True            False            True   True  True
18237  True            False            True   True  True
18238  True            False           False   True  True
18239  True             True            True   True  True
18240  True            False            True   True  True

In [26]:
# soma dos valores nulos 

nulos.isnull().sum()

id      0
nome    2
dtype: int64

In [27]:
ufo.isnull().sum()

City                  25
Colors Reported    15359
Shape Reported      2644
State                  0
Time                   0
dtype: int64

In [28]:
# filtro com valores nulos na coluna city

ufo[ufo.City.isnull()].head(10)

     City Colors Reported Shape Reported State              Time
21    NaN             NaN            NaN    LA    8/15/1943 0:00
22    NaN             NaN          LIGHT    LA    8/15/1943 0:00
204   NaN             NaN           DISK    CA   7/15/1952 12:30
241   NaN            BLUE           DISK    MT    7/4/1953 14:00
613   NaN             NaN           DISK    NV    7/1/1960 12:00
1877  NaN          YELLOW         CIRCLE    AZ    8/15/1969 1:00
2013  NaN             NaN            NaN    NH     8/1/1970 9:30
2546  NaN             NaN       FIREBALL    OH  10/25/1973 23:30
3123  NaN             RED       TRIANGLE    WV  11/25/1975 23:00
4736  NaN             NaN         SPHERE    CA   6/23/1982 23:00

In [29]:
# atribuindo shape do dataset ufo a uma variável

A = ufo.shape
A

(18241, 5)

In [30]:
# usando o dropna para remover os valores nulos

In [31]:
# parametro any: remove todos as linhas com valores nulos

B = ufo.dropna(how='any').shape
B

(2486, 5)

In [33]:
print(f'Deletadas {A[0]-B[0]} linhas com valores nulos')

Deletadas 15755 linhas com valores nulos

In [35]:
# inplace por padrão é False

ufo.dropna(how='any').shape

(2486, 5)

In [36]:
# dataframe não foi alterado

ufo.shape

(18241, 5)

In [37]:
# parametro all: remove registros onde todos os valores são nulos

ufo.dropna(how='all').shape

(18241, 5)

In [38]:
# utilizando o dropna com parametros

ufo.dropna(subset=['City', 'Shape Reported'], how='any').shape

(15576, 5)

In [39]:
ufo.dropna(subset=['City', 'Shape Reported'], how='all').shape

(18237, 5)

- 'any' -> or ou |
- 'all' -> and ou &

In [40]:
# value_counts() retorna o número de valores nulos por coluna

In [42]:
# agrupamento dos valores

ufo['Shape Reported'].value_counts().head(10)

LIGHT        2803
DISK         2122
TRIANGLE     1889
OTHER        1402
CIRCLE       1365
SPHERE       1054
FIREBALL     1039
OVAL          845
CIGAR         617
FORMATION     434
Name: Shape Reported, dtype: int64

In [44]:
# agrupamento dos valores %

ufo['Shape Reported'].value_counts(dropna=False).head(10)

LIGHT       2803
NaN         2644
DISK        2122
TRIANGLE    1889
OTHER       1402
CIRCLE      1365
SPHERE      1054
FIREBALL    1039
OVAL         845
CIGAR        617
Name: Shape Reported, dtype: int64

In [45]:
# preencher os valores nulos com valor definido

ufo['Shape Reported'].fillna(value='DIVERSOS', inplace=True)

In [46]:
ufo['Shape Reported'].value_counts().head(10)

LIGHT       2803
DIVERSOS    2644
DISK        2122
TRIANGLE    1889
OTHER       1402
CIRCLE      1365
SPHERE      1054
FIREBALL    1039
OVAL         845
CIGAR        617
Name: Shape Reported, dtype: int64

In [47]:
# buscando valor coke do dataset

In [48]:
file = './data/Sanduiches.txt'
vendas = pd.read_table(file)
vendas.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [49]:
vendas.shape

(4622, 5)

In [50]:
# tratamento de valores nulos

ordens = vendas.dropna(subset=['choice_description'], how='any')

In [52]:
ordens.shape

(3376, 5)

In [53]:
ordens.head(10)

,order_id,quantity,item_name,choice_description,item_price
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",$10.98
7,4,1,Steak Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",$11.75
8,4,1,Steak Soft Tacos,"[Tomatillo Green Chili Salsa, [Pinto Beans, Ch...",$9.25
9,5,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Pinto...",$9.25
11,6,1,Chicken Crispy Tacos,"[Roasted Chili Corn Salsa, [Fajita Vegetables,...",$8.75
12,6,1,Chicken Soft Tacos,"[Roasted Chili Corn Salsa, [Rice, Black Beans,...",$8.75
13,7,1,Chicken Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice,...",$11.25

In [54]:
# buscando ocorrencias de 'Coke'

ordens.choice_description.str.contains('Coke').astype(int).sum()

257

In [55]:
ordens.choice_description.str.contains('Coke').sum()

257

In [56]:
# pratos com guacamole

ordens.choice_description.str.contains('Guacamole').sum()

1037

In [58]:
# pratos com arroz

ordens.choice_description.str.contains('Rice').sum()

2402

- Codes adc

In [25]:
# valores completos

ufo.notnull().sum()/len(ufo) *100

City                99.862946
Colors Reported     15.799572
Shape Reported      85.505181
State              100.000000
Time               100.000000
dtype: float64

In [20]:
# percentual de valores nulos

ufo.isnull().sum()/ len(ufo) *100

City                0.137054
Colors Reported    84.200428
Shape Reported     14.494819
State               0.000000
Time                0.000000
dtype: float64

In [59]:
ufo['Shape Reported'].value_counts(normalize=True).head(10)

LIGHT       0.153665
DIVERSOS    0.144948
DISK        0.116331
TRIANGLE    0.103558
OTHER       0.076860
CIRCLE      0.074831
SPHERE      0.057782
FIREBALL    0.056960
OVAL        0.046324
CIGAR       0.033825
Name: Shape Reported, dtype: float64